## [applications/testing/prod](https://omicron7.app.spacelift.io/stack/applications-testing-prod/run/01HSH91AT21RNPSF4ZQM75AKY8) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HSH74SRYKF3MVWVK5KN04G23] Planning changes with 0 custom hooks...
data.spacelift_current_stack.this: Reading...
data.spacelift_aws_integration.aws: Reading...
data.spacelift_current_stack.this: Read complete after 0s [id=applications-testing-prod]
data.spacelift_stack.this: Reading...
data.spacelift_aws_integration.aws: Read complete after 0s [id=01HQV4XANFANXQY4NS3HDNJSCN]
data.spacelift_stack.this: Read complete after 0s [id=applications-testing-prod]
spacelift_stack.this: Preparing import... [id=applications-testing-prod]
spacelift_stack.this: Refreshing state... [id=applications-testing-prod]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # ansible_group.linux will be created
  + resource "ansible_group" "linux" {
      + id        = (known after apply)
      + name      = "prod"
      + variables = {
          + "ansible_user" = "root"
          + "os"           = "linux"
        }
    }

  # ansible_host.app1 will be created
  + resource "ansible_host" "app1" {
      + groups    = [
          + "prod",
        ]
      + id        = (known after apply)
      + name      = "app1"
      + variables = {
          + "ansible_host" = "127.0.0.1"
        }
    }

  # ansible_host.app2 will be created
  + resource "ansible_host" "app2" {
      + groups    = [
          + "prod",
        ]
      + id        = (known after apply)
      + name      = "app2"
      + variables = {
          + "ansible_host" = "127.0.0.1"
        }
    }

  # spacelift_aws_integration_attachment.aws will be created
  + resource "spacelift_aws_integration_attachment" "aws" {
      + attachment_id  = (known after apply)
      + id             = (known after apply)
      + integration_id = "01HQV4XANFANXQY4NS3HDNJSCN"
      + read           = true
      + stack_id       = (known after apply)
      + write          = true
    }

  # spacelift_environment_variable.terraform_state_key will be created
  + resource "spacelift_environment_variable" "terraform_state_key" {
      + checksum   = (known after apply)
      + id         = (known after apply)
      + name       = "TERRAFORM_STATE_KEY"
      + stack_id   = (known after apply)
      + value      = (sensitive value)
      + write_only = false
    }

  # spacelift_stack.ansible will be created
  + resource "spacelift_stack" "ansible" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + enable_local_preview             = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + labels                           = [
          + "ansible",
        ]
      + manage_state                     = true
      + name                             = "Ansible (applications/testing/prod)"
      + protect_from_deletion            = false
      + repository                       = "spacelift-ansible"
      + runner_image                     = "public.ecr.aws/y7n4m3q8/spacelift-runner-ansible:latest"
      + slug                             = (known after apply)
      + space_id                         = "omicron7-01HS1TBZCJ35FSNJ9AC9QTY7WF"
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)

      + ansible {
          + playbook = "playbook.yml"
        }
    }

  # spacelift_stack.this will be imported
    resource "spacelift_stack" "this" {
        additional_project_globs         = []
        administrative                   = true
        after_apply                      = []
        after_destroy                    = []
        after_init                       = []
        after_perform                    = []
        after_plan                       = []
        after_run                        = []
        autodeploy                       = false
        autoretry                        = false
        aws_assume_role_policy_statement = jsonencode(
            {
                Action    = "sts:AssumeRole"
                Condition = {
                    StringEquals = {
                        "sts:ExternalId" = "Omicron7@applications-testing-prod"
                    }
                }
                Effect    = "Allow"
                Principal = {
                    AWS = "324880187172"
                }
            }
        )
        before_apply                     = []
        before_destroy                   = []
        before_init                      = []
        before_perform                   = []
        before_plan                      = []
        branch                           = "main"
        enable_local_preview             = false
        github_action_deploy             = true
        id                               = "applications-testing-prod"
        labels                           = [
            "feature:add_plan_pr_comment",
            "nobackend",
            "terraform",
        ]
        manage_state                     = false
        name                             = "applications/testing/prod"
        project_root                     = "applications/testing/prod"
        protect_from_deletion            = false
        repository                       = "terraform"
        slug                             = "applications-testing-prod"
        space_id                         = "omicron7-01HS1TBZCJ35FSNJ9AC9QTY7WF"
        terraform_external_state_access  = false
        terraform_smart_sanitization     = false
        terraform_version                = "~>1.6.2"
        terraform_workflow_tool          = "OPEN_TOFU"
    }

Plan: 1 to import, 6 to add, 0 to change, 0 to destroy.

[01HSH74SRYKF3MVWVK5KN04G23] Changes are GO
[01HSH74SRYKF3MVWVK5KN04G23] Uploading the list of managed resources...
[01HSH74SRYKF3MVWVK5KN04G23] Please be aware that the run changes calculation includes output changes.
[01HSH74SRYKF3MVWVK5KN04G23] Resource list upload is GO
[01HSH74SRYKF3MVWVK5KN04G23] Generating JSON representation of the plan...
[01HSH74SRYKF3MVWVK5KN04G23] JSON representation is GO
[01HSH74SRYKF3MVWVK5KN04G23] Loading custom plan policy inputs...
[01HSH74SRYKF3MVWVK5KN04G23] 0 custom plan policy inputs found
[01HSH74SRYKF3MVWVK5KN04G23] No plan policies to evaluate
```

</details>